КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказНаВнутреннееПотребление/ЗаказНаВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0281d76f-6aa0-4fff-ab25-5a81258abfb3">
  <name>ЗаказНаВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="24954df4-97a3-4c21-b4c7-d26d53fc581c">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3a3c3667-121d-46f4-9b5f-3490c0bc2096">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff47e900-26d4-480f-862d-e7a594cde170">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3130c2d1-275a-4006-8bec-ffc8eadaf912">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0aeb3cc1-b98d-4a23-b4e7-ca886f1d7760">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7f6c7649-03f7-4531-a0ff-667746572c89">
    <name>НеОтгружатьЧастями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="52009dd6-b878-4140-8aa7-3132443e38b5">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="16083496-4922-46b4-8923-8a616d3a38f5">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8c326d07-bde5-4de9-8ee9-7b0cbeb425dc">
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3c7396b0-71b0-4c54-b9bf-4c429c4af1f6">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5e644ba4-eb16-4e44-abc3-e9875c22d963">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e61e315d-0201-4170-9434-0ecf2df4acca">
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c79e41c6-36a3-439d-981c-102d63e2edaf">
    <name>ПотреблениеДляДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7bbbdf9-af5c-46a4-a3dd-22f29c629580">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a7cdfa19-1cf0-4569-a223-9978a628fd33">
    <name>Доставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41585b49-2c94-42a7-8519-f20e33a5384a">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="0c65fe73-4b60-4819-b7d6-6271b93f49c0">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="34979ae1-b89c-4773-8859-a4bb141a1b6c">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a493f73d-fd31-432a-9c3b-3850248a88de">
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="787263e8-8b37-4909-8ba3-ceb64a99e45a">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dc773a0d-fdfb-426d-9bc6-c8aef6f0cc48">
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7e29b35c-2b97-4448-a6ac-4a100b369ab7">
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="77116461-ac9f-4a9c-add9-f1b6a101b5a0">
      <name>ФизическоеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1745080b-8b4c-4748-99c3-ee4ecd0743af">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="100844ba-e7f4-4f4c-8d88-1f862d0ccc04">
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="59d49912-6073-4437-8cee-07c5891a5d03">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d2a871c2-64f0-4de9-a25b-99fbc44b3007">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="407a3120-812f-4f00-b668-45965e45579a">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3309a46c-baca-46cf-805a-d96882210186">
      <name>КатегорияЭксплуатации</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="66ac4c48-937a-4783-8732-8cf4af34a45e">
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26c6d2d9-2f9f-4ae8-8d9b-f428e45c55d2">
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cbd47db1-d106-4953-94ba-cc0896cffd60">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d07e4b33-386b-4ebb-9e43-704b751106cd">
      <name>Основание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/InformationRegisters/СостоянияИРеквизитыДоставки/СостоянияИРеквизитыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="a868ca92-056a-4d0a-9f81-cc25dea4689c">
  <name>СостоянияИРеквизитыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4b8c4a32-452b-431e-9ba6-e6fa9ee5dc8f">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="16537153-fd12-4040-86a7-4bb183c97956">
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2515e3f-e33c-47d8-a4f8-42ba1311b2dc">
    <name>ДоставитьПолностью</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="3e564b1d-32c6-4e35-9a58-ff82d0fd12cb">
    <name>АдресЗначенияПолей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd68befe-2334-4d95-8c5a-a5c3f5c6dae7">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0952911e-4115-4fc1-8161-ec8d869b6e22">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e50733ba-8c2b-43f4-8b6b-f08aba09426f">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a34c5373-d556-4306-9808-d83683aed4be">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a2d03338-d318-44c2-9fee-f97621d48919">
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="24629c7a-2abc-4adb-a4d4-902c71d7a2f7">
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e66d78d-cd8d-4564-8d21-81662a1b2074">
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="87e51901-d207-4011-b41b-632ba0fc6a2d">
    <name>РазбиватьРасходныеОрдераПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="29a20d1e-315f-455e-8d43-502dae4f474d">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="57331f56-a991-4c76-b1d7-3247bbfa242f">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="282e3d2c-3a88-4cf3-af5b-3714e1dae3c9">
    <name>ПолучательОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1813e264-2d40-46be-a153-33cdcb2afbc1">
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f6c04ea1-ba45-4ee9-bcab-d0e6ee33f03d">
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="be7fb96b-cc04-4619-a713-d62235916a69">
    <name>Зона</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ЗаказНаВнутреннееПотребление/ObjectModule.bsl
&Вместо("ОбработкаЗаполнения")
Процедура ОД_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Перем РеквизитыШапки;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Товары") Тогда
		
		ДанныеЗаполнения.Свойство("РеквизитыШапки", РеквизитыШапки);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыШапки);
		Товары.Загрузить(ДанныеЗаполнения.Товары);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Если ДанныеЗаполнения.Количество() > 0 Тогда

			ПервыйДок = ДанныеЗаполнения[0];
			
			Если ТипЗнч(ПервыйДок) = Тип("ДокументСсылка.Рекламация") Тогда
				
				Если ПервыйДок.Состояние = Перечисления.Рекл_СостоянияРекламации.Отгружена
					ИЛИ ПервыйДок.Состояние = Перечисления.Рекл_СостоянияРекламации.ПереданоВСборку
					ИЛИ ПервыйДок.Состояние = Перечисления.Рекл_СостоянияРекламации.Закрыта Тогда
				
					ДокументОснование	= ПервыйДок;
					Организация			= ПервыйДок.Организация;
					Склад				= ПервыйДок.Склад;
					Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);

					Для каждого Т Из ПервыйДок.Комплектующие Цикл
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
						НоваяСтрока.КоличествоУпаковок	= НоваяСтрока.Количество;
						НоваяСтрока.СтатьяРасходов		= ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
						НоваяСтрока.АналитикаРасходов	= ПервыйДок.Партнер;
					КонецЦикла;
				Иначе
					Сообщить("Для списания требуется статус Отгружена, Закрыта или Передано в сборку");
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ПервыйДок) = Тип("ДокументСсылка.Ремонт") Тогда

				Если ДанныеЗаполнения.Количество() = 1 Тогда
					ДокументОснование = ПервыйДок;
				КонецЕсли;

				Организация			= ПервыйДок.Организация;
				Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Торговый отдел", Истина);
				ДатаОтгрузки		= НачалоДня(ТекущаяДатаСеанса()) + 86400;
				НеОтгружатьЧастями	= Истина;

				ТЧ_Запчасти = ПервыйДок.Запчасти;
				Если ТЧ_Запчасти.Количество() > 0 Тогда
					Склад = ТЧ_Запчасти[0].Склад;
				КонецЕсли;

				Для каждого Док Из ДанныеЗаполнения Цикл
					Для каждого Т Из Док.Запчасти Цикл
						НоваяСтрока = Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Т);
						НоваяСтрока.Количество			= Т.Количество;
						НоваяСтрока.КоличествоУпаковок	= Т.Количество;
						НоваяСтрока.СтатьяРасходов		= ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Рекламация", Истина);
						НоваяСтрока.АналитикаРасходов	= Док.Партнер;
						НоваяСтрока.ДатаОтгрузки		= ДатаОтгрузки;

						Если ЗначениеЗаполнено(Док.ПартнерОсуществляетРемонт) Тогда
							НоваяСтрока.АналитикаРасходов = Док.ПартнерОсуществляетРемонт;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;

				Для каждого Док Из ДанныеЗаполнения Цикл
					НоваяСтрока = Основания.Добавить();
					НоваяСтрока.Основание = Док;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ОД_ОбработкаПроведения(Отказ, РежимПроведения)

	Партнер = "";
	Если Товары.Количество() > 0 Тогда
		АналитикаРасходов = Товары[0].АналитикаРасходов;
		Если ТипЗнч(АналитикаРасходов) = Тип("СправочникСсылка.Партнеры") Тогда
			Партнер = АналитикаРасходов;
		КонецЕсли;
	КонецЕсли;
	
	Если Доставка 
		И ЗначениеЗаполнено(АдресДоставки) 
		И ЗначениеЗаполнено(Партнер) Тогда
		
		Если ЗначениеЗаполнено(ДатаОтгрузки) Тогда
			НЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьНаборЗаписей();
			НЗ.Отбор.Распоряжение.Установить(Ссылка);
			НЗ.Записать();

			МЗ = РегистрыСведений.СостоянияИРеквизитыДоставки.СоздатьМенеджерЗаписи();
			МЗ.Распоряжение 			= Ссылка;
			МЗ.Склад					= Склад;
			МЗ.СпособДоставки   		= Перечисления.СпособыДоставки.ПоручениеЭкспедиторуСоСклада;
			//МЗ.Зона						= ЗонаДоставки;
			МЗ.ПолучательОтправитель	= Партнер;
			
			МЗ.ДополнительнаяИнформация	= УправлениеСвойствами.ЗначениеСвойства(Ссылка, "КомментарийДляДоставки");
			МЗ.Состояние				= Перечисления.СостоянияДоставки.ТребуетсяДоставка;
			МЗ.ДоставитьПолностью   	= Истина;
			МЗ.Дата						= ДатаОтгрузки;
			МЗ.Номер					= Ссылка.Номер;
			
			МЗ.Адрес = АдресДоставки;
			
			МЗ.Записать();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура ОД_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;

	Документы.ЗаказНаВнутреннееПотребление.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
	ХозяйственнаяОперация, 
	МассивВсехРеквизитов, 
	МассивРеквизитовОперации);

	МассивНепроверяемыхРеквизитов = Новый Массив;

	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
	МассивВсехРеквизитов,
	МассивРеквизитовОперации,
	МассивНепроверяемыхРеквизитов);

	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаОтгрузки");

	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);

	ВсеСтрокиОтменены = Истина;
	ВариантНеТребуется = Перечисления.ВариантыОбеспечения.НеТребуется;
	Для Каждого СтрокаТаблицы Из Товары Цикл
		ВсеСтрокиОтменены = ВсеСтрокиОтменены И(
		СтрокаТаблицы.Отменено Или СтрокаТаблицы.ВариантОбеспечения = ВариантНеТребуется);
	КонецЦикла;

	Если Не НеОтгружатьЧастями
		Или НеОтгружатьЧастями И ВсеСтрокиОтменены Тогда

		МассивНепроверяемыхРеквизитов.Добавить("ДатаОтгрузки");

	КонецЕсли;

	Если ВсеСтрокиОтменены Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Склад");
	КонецЕсли;
	
	#Вставка
	МассивНепроверяемыхРеквизитов.Добавить("АдресДоставки");
	#КонецВставки

	// Желаемая дата отгрузки в шапке должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ЖелаемаяДатаОтгрузки) И ЖелаемаяДатаОтгрузки < НачалоДня(Дата) Тогда

		ТекстОшибки = НСтр("ru='Желаемая дата отгрузки должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ЖелаемаяДатаОтгрузки",
		,
		Отказ);

	КонецЕсли;

	// Дата отгрузки в шапке должна быть не меньше даты документа
	Если НеОтгружатьЧастями
		И ЗначениеЗаполнено(ДатаОтгрузки)
		И ДатаОтгрузки < НачалоДня(Дата)
		И Не ВсеСтрокиОтменены Тогда

		ТекстОшибки = НСтр("ru='Дата отгрузки должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ТекстОшибки,
		ЭтотОбъект,
		"ДатаОтгрузки",
		,
		Отказ);

	КонецЕсли;

	Для каждого СтрокаТЧ Из Товары Цикл

		АдресОшибки = " " + НСтр("ru='в строке %НомерСтроки% списка ""Товары""'");
		АдресОшибки = СтрЗаменить(АдресОшибки,"%НомерСтроки%", СтрокаТЧ.НомерСтроки);

		Если Не НеОтгружатьЧастями И СтрокаТЧ.ВариантОбеспечения <> ВариантНеТребуется
			И Не СтрокаТЧ.Отменено И Не ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) Тогда

			ТекстОшибки = НСтр("ru='Не заполнена колонка ""Дата отгрузки""'");

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "ДатаОтгрузки"),
			,
			Отказ);

		КонецЕсли;

		// Дата отгрузки в тч Товары должна быть не меньше даты документа
		Если Не НеОтгружатьЧастями И ЗначениеЗаполнено(СтрокаТЧ.ДатаОтгрузки) И СтрокаТЧ.ДатаОтгрузки < НачалоДня(Дата) Тогда

			ТекстОшибки = НСтр("ru='Дата отгрузки должна быть не меньше даты документа ""%Дата%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%Дата%", Формат(Дата, "ДЛФ=DD"));

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки + АдресОшибки,
			ЭтотОбъект,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТЧ.НомерСтроки, "ДатаОтгрузки"),
			,
			Отказ);

		КонецЕсли;

	КонецЦикла;

	Если Не НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(ХозяйственнаяОперация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаправлениеДеятельности");
	КонецЕсли;

	ПланыВидовХарактеристик.СтатьиРасходов.ПроверитьЗаполнениеАналитик(
	ЭтотОбъект, Новый Структура("Товары"), МассивНепроверяемыхРеквизитов, Отказ);

	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(
	ЭтотОбъект,
	НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказНаВнутреннееПотребление),
	Отказ,
	МассивНепроверяемыхРеквизитов);

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	ПараметрыПроверки = УчетНДСУП.ПараметрыПроверкиЗаполненияДокументаПоВидуДеятельностиНДС();
	ПараметрыПроверки.ИмяТабличнойЧасти = "Товары";
	ПараметрыПроверки.ИмяРеквизитаСтатьяРасходов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаРасходов = "АналитикаРасходов";
	ПараметрыПроверки.ИмяРеквизитаСтатьяАктивовПассивов = "СтатьяРасходов";
	ПараметрыПроверки.ИмяРеквизитаАналитикаАктивовПассивов = "АналитикаАктивовПассивов";

	УчетНДСУП.ПроверитьЗаполнениеДокументаПоВидуДеятельностиНДС(
	ЭтотОбъект,
	ПотреблениеДляДеятельности,
	ПараметрыПроверки,
	Отказ);

КонецПроцедуры
